{
  "RSPGame.feature.h1": "Game function",
  "RSPGame.feature.h2": "Local Storage",
  "RSPGame.feature.p1": "the game determines the winner based on predefined rules (e.g., rock beats scissors, scissors beats paper, paper beats rock)",
  "RSPGame.feature.p2": "Each time a game is played, the score may be updated based on the outcome (win, lose, or tie).",
  "RSPGame.header": "RockPaperScissors Game",
  "about.btn": "About Me",
  "about.m.header1": "I would like to",
  "about.m.header2": "learn",
  "about.m.header3": "in the future",
  "about.other.header1": "Other",
  "about.other.header2": "skills",
  "about.skill.header1": "Programming",
  "about.skill.header2": "skills",
  "acnh.feature.h1": "Authentication state in frontend",
  "acnh.feature.h2": "Communicating with Rest API",
  "acnh.feature.h3": "Tags filtering & Searching",
  "acnh.feature.h4": "Material-UI",
  "acnh.feature.p1": "Visitors can sign up and login, logout.",
  "acnh.feature.p2": "Get Item & villagers data from Public API, Visitors can save & delete villagers to Island villagers and Favorite villagers.",
  "acnh.feature.p3": "Visitors can filter Villagers by personality tag, can search villagers and items by name.",
  "acnh.feature.p4": "Thanks to MUI it was really easy to create a nice looking and easily usable interface without writing even a line of CSS",
  "acnh.header": "Fan site for Animal Crossing New Horizons (Nintendo game).",
  "begopa.feature.h1": "Authentication state in frontend",
  "begopa.feature.h2": "Communicating with Rest API",
  "begopa.feature.h3": "Tags filtering & Searching",
  "begopa.feature.p1": "Visitors can sign up and login, logout.",
  "begopa.feature.p2": "Visitors can submit their recipes which is editable & deletable, also can decide public or private.",
  "begopa.feature.p3": "Visitors can filter recipes by tag that named from them, can search recipe by name",
  "begopa.header": "For my very first React project I choose to create a recipe website for myself. My goal was practice Real world API communication.",
  "downcv.btn": "Download CV",
  "experience.header": "Experience",
  "experience.project.h1": "Signature Assistant (Demo.ver)",
  "experience.project.h2": "National Disaster Management Research",
  "experience.project.h3": "MandoHL",
  "experience.project.p1": "This application is a helper tool for signature comparison, offering two main features. The first feature allows users to upload a signature image and use the tools provided on the canvas (pen, line, shape, text, etc.) to edit or add to the signature, and you can save or export the results. The second feature enables users to upload two signature images and utilize AI to compare the similarities between the two signatures.",
  "experience.project.p1.sub": "As a frontend developer, I designed the UI/UX and implemented the canvas functionality using Fabric.js.",
  "experience.project.p2": "This project was an application that receives news, as well as information on Korean laws and safety regulations via an API, stores it on a server, and manages the data. I was assigned to add new features to the existing functionality. To maintain the design of the original code, I worked closely with my colleagues throughout the project. My main responsibilities were communicating with the REST API and implementing the user interface.",
  "experience.project.p3": "This project was a system that collects data from a steering wheel testing machine and displays it in real-time as graphs. I was responsible for designing the overall UI/UX and implementing the graphs using ECharts after fetching the data.",
  "experience.project.review.p1": "I found working with Fabric.js challenging, especially when implementing features like changing the color, stroke, opacity, and arrangement of shapes, as well as handling save and delete functionality. I struggled with optimizing Fabric.js and using useRef, as I wasn’t familiar with them",
  "experience.project.review.p2": "Due to the need to handle a large volume of data and implement a different transmission method from the existing backend approach, I was able to collaborate closely with the backend developers. Additionally, while conducting manual testing, I had the opportunity to write a test log for the first time, and through this process, I discovered many bugs and realized the importance of testing.",
  "experience.project.review.p3": "In this project, I had to work with a REST API created using a specialized backend program called Matlab. Unlike the existing backend code, I had to handle complex nested data structures. it was difficult to determine where each piece of data was needed. To implement the graphs, I communicated extensively with the backend developer, and for the first time, I encountered CORS issues and learned how to resolve them.",
  "experience.project.tech": "Used technologies",
  "experience.subHeader": "A list of the official projects I participated at so far",
  "experience.time.p1": "Time spent on project",
  "experience.time.p2": "months",
  "firstname": "CHEYOON",
  "gotoExperience.btn": "Go to Experience",
  "home.paragraph1": "I majored Movie Image Design and worked as a graphic designer for almost 2 years, where I learned to use several design tools.",
  "home.paragraph2": "I was also introduced to the world of IT, which led me to start a journey into frontend development",
  "lastname": "JUNG",
  "location.city": "Budapest",
  "location.country": "Hungary",
  "pokemon.feature.h1": "Local storage",
  "pokemon.feature.h2": "Game difficulty",
  "pokemon.feature.h3": "Responsive UI",
  "pokemon.feature.p1": "User can check their best score.",
  "pokemon.feature.p2": "user can choose 3 different type of game difficulty.",
  "pokemon.feature.p3": "It's look fine on both desktops, tablets and mobile phones.",
  "pokemon.header": "Memory game with React",
  "portfolio.btn": "Show more",
  "portfolio.feature.h": "Features:",
  "portfolio.footer.h": "For the code repository",
  "portfolio.footer.p": "Click here",
  "portfolio.link.message": "Try it here",
  "skill.css": "I'd like to become css magician",
  "skill.html": "I am comfortable with using Html",
  "skill.js": "I'm trying not to forget VanillaJS",
  "skill.react": "I'd like to dive deeper into React",
  "skill.scss": "I love it",
  "skill.threejs": " I am curios how Three.js is ",
  "skill.ts": "Exploring!",
  "thisPortfolio.feature.h1": "Introduction + Portfolio",
  "thisPortfolio.feature.h2": "Dark and light themes",
  "thisPortfolio.feature.p1": "Visitors can read about me, my skills, also can check out my developer portfolio.",
  "thisPortfolio.feature.p2": "Switching between the light and dark theme is possible without any glitch thanks to the flexibility of CSS variables.",
  "thisPortfolio.header1": "My new portfolio website made with React.",
  "thisPortfolio.header2": "You can check my old Portfolio site code that written in vanilla javascript and see how I am improved!",
  "three.feature.h1": "Playable",
  "three.feature.h2": "Physics",
  "three.feature.p1": "Visitors can move character.",
  "three.feature.p2": "Visitors can interact with some objects.",
  "three.header": "My first R3F site."
}